# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv tlb.v
read_verilog -sv dcache.v
read_verilog -sv load_unit.v
read_verilog -sv store_unit.v
read_verilog -sv load_queue.v
read_verilog -sv store_queue.v
read_verilog -sv sbuffer.v
read_verilog -sv prefetcher.v
read_verilog -sv memblock.v
hierarchy -top memblock
proc; opt; memory; opt
synth -top memblock
