# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv dispatch.v
hierarchy -top dispatch
proc; opt; memory; opt
synth -top dispatch
