# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv fifo_loopback.v
hierarchy -top fifo_loopback
proc; opt; memory; opt
synth -top fifo_loopback
