# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv decode_rules.v
hierarchy -top decode_rules
proc; opt; memory; opt
synth -top decode_rules
