# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv issue_queue.v
hierarchy -top issue_queue
proc; opt; memory; opt
synth -top issue_queue
