# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv coupled_l2.v
hierarchy -top coupled_l2
proc; opt; memory; opt
synth -top coupled_l2
