# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv obs_points.v
hierarchy -top obs_points
proc; opt; memory; opt
synth -top obs_points
