# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv struct_transform.v
hierarchy -top struct_transform
proc; opt; memory; opt
synth -top struct_transform
