# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv cache_params.v
hierarchy -top cache_params
proc; opt; memory; opt
synth -top cache_params
