# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv fpu.v
hierarchy -top fpu
proc; opt; memory; opt
synth -top fpu
