# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv l2_top.v
hierarchy -top l2_top
proc; opt; memory; opt
synth -top l2_top
