# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv digital_clock.v
hierarchy -top digital_clock
proc; opt; memory; opt
synth -top digital_clock
