# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv load_unit.v
hierarchy -top load_unit
proc; opt; memory; opt
synth -top load_unit
