# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv ittage.v
hierarchy -top ittage
proc; opt; memory; opt
synth -top ittage
