# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv tage.v
hierarchy -top tage
proc; opt; memory; opt
synth -top tage
