# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv icache.v
hierarchy -top icache
proc; opt; memory; opt
synth -top icache
