# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv ubtb.v
read_verilog -sv tage.v
read_verilog -sv sc.v
read_verilog -sv ittage.v
read_verilog -sv ras.v
read_verilog -sv bpu.v
hierarchy -top bpu
proc; opt; memory; opt
synth -top bpu
