# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv ubtb.v
read_verilog -sv tage.v
read_verilog -sv sc.v
read_verilog -sv ittage.v
read_verilog -sv ras.v
read_verilog -sv bpu.v
read_verilog -sv ftq.v
read_verilog -sv icache.v
read_verilog -sv ifu.v
read_verilog -sv ibuffer.v
read_verilog -sv decode.v
read_verilog -sv frontend.v
hierarchy -top frontend
proc; opt; memory; opt
synth -top frontend
