# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv decode.v
hierarchy -top decode
proc; opt; memory; opt
synth -top decode
