# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv bru.v
hierarchy -top bru
proc; opt; memory; opt
synth -top bru
