# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv boundary_value_ports.v
hierarchy -top boundary_value_ports
proc; opt; memory; opt
synth -top boundary_value_ports
