# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv bypass_unit.v
hierarchy -top bypass_unit
proc; opt; memory; opt
synth -top bypass_unit
