# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv ras.v
hierarchy -top ras
proc; opt; memory; opt
synth -top ras
