# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv regfile.v
hierarchy -top regfile
proc; opt; memory; opt
synth -top regfile
