# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv ubtb.v
hierarchy -top ubtb
proc; opt; memory; opt
synth -top ubtb
