# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv multiclock_regs.v
hierarchy -top multiclock_regs
proc; opt; memory; opt
synth -top multiclock_regs
