# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv calculator.v
hierarchy -top calculator
proc; opt; memory; opt
synth -top calculator
