# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv fastfwd.v
hierarchy -top fastfwd
proc; opt; memory; opt
synth -top fastfwd
