# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv jit_control_flow.v
hierarchy -top jit_control_flow
proc; opt; memory; opt
synth -top jit_control_flow
