# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv store_unit.v
hierarchy -top store_unit
proc; opt; memory; opt
synth -top store_unit
