# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv prefetcher.v
hierarchy -top prefetcher
proc; opt; memory; opt
synth -top prefetcher
