# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv ftq.v
hierarchy -top ftq
proc; opt; memory; opt
synth -top ftq
