# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv rob.v
hierarchy -top rob
proc; opt; memory; opt
synth -top rob
