# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv mem_rdw_olddata.v
hierarchy -top mem_rdw_olddata
proc; opt; memory; opt
synth -top mem_rdw_olddata
