# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv div.v
hierarchy -top div
proc; opt; memory; opt
synth -top div
