# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv fetch.v
read_verilog -sv decoder.v
read_verilog -sv rename.v
read_verilog -sv dispatch.v
read_verilog -sv scalar_rs.v
read_verilog -sv alu.v
read_verilog -sv muldiv.v
read_verilog -sv bru.v
read_verilog -sv lsu_rs.v
read_verilog -sv lsu.v
read_verilog -sv vec_rs.v
read_verilog -sv cube_rs.v
read_verilog -sv mte_rs.v
read_verilog -sv davinci_top.v
hierarchy -top davinci_top
proc; opt; memory; opt
synth -top davinci_top
