# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv ifu.v
hierarchy -top ifu
proc; opt; memory; opt
synth -top ifu
