# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv counter.v
hierarchy -top counter
proc; opt; memory; opt
synth -top counter
