# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv rename.v
hierarchy -top rename
proc; opt; memory; opt
synth -top rename
