# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv sbuffer.v
hierarchy -top sbuffer
proc; opt; memory; opt
synth -top sbuffer
