# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv pipeline_builder.v
hierarchy -top pipeline_builder
proc; opt; memory; opt
synth -top pipeline_builder
