# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv ibuffer.v
hierarchy -top ibuffer
proc; opt; memory; opt
synth -top ibuffer
