# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv hier_modules.v
hierarchy -top hier_modules
proc; opt; memory; opt
synth -top hier_modules
