# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv xs_regfile.v
hierarchy -top xs_regfile
proc; opt; memory; opt
synth -top xs_regfile
