# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv tregfile.v
hierarchy -top tregfile
proc; opt; memory; opt
synth -top tregfile
