# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv sc.v
hierarchy -top sc
proc; opt; memory; opt
synth -top sc
