# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv wire_ops.v
hierarchy -top wire_ops
proc; opt; memory; opt
synth -top wire_ops
