# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv plic.v
hierarchy -top plic
proc; opt; memory; opt
synth -top plic
