# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv net_resolution_depth_smoke.v
hierarchy -top net_resolution_depth_smoke
proc; opt; memory; opt
synth -top net_resolution_depth_smoke
