# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv clint.v
hierarchy -top clint
proc; opt; memory; opt
synth -top clint
