# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv mul.v
hierarchy -top mul
proc; opt; memory; opt
synth -top mul
