# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv load_queue.v
hierarchy -top load_queue
proc; opt; memory; opt
synth -top load_queue
