# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv issue_queue_2picker.v
hierarchy -top issue_queue_2picker
proc; opt; memory; opt
synth -top issue_queue_2picker
