# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv dcache.v
hierarchy -top dcache
proc; opt; memory; opt
synth -top dcache
