# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv digital_filter.v
hierarchy -top digital_filter
proc; opt; memory; opt
synth -top digital_filter
