# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv store_queue.v
hierarchy -top store_queue
proc; opt; memory; opt
synth -top store_queue
