# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv rename.v
read_verilog -sv dispatch.v
read_verilog -sv rob.v
read_verilog -sv ctrlblock.v
hierarchy -top ctrlblock
proc; opt; memory; opt
synth -top ctrlblock
