# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv sync_mem_init_zero.v
hierarchy -top sync_mem_init_zero
proc; opt; memory; opt
synth -top sync_mem_init_zero
