# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv arith.v
hierarchy -top arith
proc; opt; memory; opt
synth -top arith
