# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv jit_pipeline_vec.v
hierarchy -top jit_pipeline_vec
proc; opt; memory; opt
synth -top jit_pipeline_vec
