# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv tlb.v
hierarchy -top tlb
proc; opt; memory; opt
synth -top tlb
