# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv alu.v
hierarchy -top alu
proc; opt; memory; opt
synth -top alu
