# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv rename.v
read_verilog -sv dispatch.v
read_verilog -sv rob.v
read_verilog -sv ctrlblock.v
read_verilog -sv issue_queue.v
read_verilog -sv regfile.v
read_verilog -sv alu.v
read_verilog -sv bru.v
read_verilog -sv mul.v
read_verilog -sv div.v
read_verilog -sv fpu.v
read_verilog -sv backend.v
hierarchy -top backend
proc; opt; memory; opt
synth -top backend
